; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob86) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate11)
	(at pallet1 distributor0)
	(clear crate13)
	(at pallet2 distributor1)
	(clear crate14)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 350)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 382)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 67)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 94)
	(at crate2 distributor0)
	(on crate2 crate0)
	(= (weight crate2) 36)
	(at crate3 depot0)
	(on crate3 crate1)
	(= (weight crate3) 87)
	(at crate4 distributor0)
	(on crate4 crate2)
	(= (weight crate4) 38)
	(at crate5 distributor1)
	(on crate5 pallet2)
	(= (weight crate5) 16)
	(at crate6 distributor1)
	(on crate6 crate5)
	(= (weight crate6) 83)
	(at crate7 depot0)
	(on crate7 crate3)
	(= (weight crate7) 51)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 92)
	(at crate9 distributor0)
	(on crate9 crate4)
	(= (weight crate9) 94)
	(at crate10 depot0)
	(on crate10 crate7)
	(= (weight crate10) 69)
	(at crate11 depot0)
	(on crate11 crate10)
	(= (weight crate11) 86)
	(at crate12 distributor1)
	(on crate12 crate8)
	(= (weight crate12) 33)
	(at crate13 distributor0)
	(on crate13 crate9)
	(= (weight crate13) 61)
	(at crate14 distributor1)
	(on crate14 crate12)
	(= (weight crate14) 1)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 crate13)
		(on crate3 crate4)
		(on crate4 crate7)
		(on crate5 crate14)
		(on crate6 crate1)
		(on crate7 pallet0)
		(on crate8 crate5)
		(on crate9 crate12)
		(on crate10 crate6)
		(on crate12 pallet2)
		(on crate13 crate9)
		(on crate14 pallet1)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 0 to 10
   goals met: 1 of 13
2. (lift hoist2 crate14 crate12 distributor1)
   deleted: (at crate14 distributor1) (clear crate14) (available hoist2) (on crate14 crate12)
   added: (lifting hoist2 crate14) (clear crate12)
   changed: (fuel-cost) from 10 to 11
   goals met: 1 of 13
3. (lift hoist0 crate11 crate10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate10)
   added: (lifting hoist0 crate11) (clear crate10)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 13
4. (lift hoist1 crate13 crate9 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 crate9)
   added: (lifting hoist1 crate13) (clear crate9)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 13
5. (load hoist1 crate13 truck1 distributor0)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 61
   goals met: 0 of 13
6. (lift hoist1 crate9 crate4 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate4)
   added: (lifting hoist1 crate9) (clear crate4)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 13
7. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 13
8. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 86
   goals met: 0 of 13
9. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 13
10. (lift hoist0 crate10 crate7 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate7)
   added: (lifting hoist0 crate10) (clear crate7)
   changed: (fuel-cost) from 34 to 35
   goals met: 0 of 13
11. (load hoist2 crate14 truck0 distributor1)
   deleted: (lifting hoist2 crate14)
   added: (in crate14 truck0) (available hoist2)
   changed: (current_load truck0) from 86 to 87
   goals met: 0 of 13
12. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 61 to 155
   goals met: 0 of 13
13. (lift hoist1 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   changed: (fuel-cost) from 35 to 36
   goals met: 0 of 13
14. (lift hoist2 crate12 crate8 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist2) (on crate12 crate8)
   added: (lifting hoist2 crate12) (clear crate8)
   changed: (fuel-cost) from 36 to 37
   goals met: 0 of 13
15. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 37 to 47
   goals met: 0 of 13
16. (drop hoist1 crate4 crate2 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate2)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate2)
   goals met: 0 of 13
17. (load hoist2 crate12 truck1 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck1) (available hoist2)
   changed: (current_load truck1) from 155 to 188
   goals met: 0 of 13
18. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 47 to 57
   goals met: 0 of 13
19. (lift hoist2 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate6)
   added: (lifting hoist2 crate8) (clear crate6)
   changed: (fuel-cost) from 57 to 58
   goals met: 0 of 13
20. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 58 to 68
   goals met: 0 of 13
21. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 188 to 280
   goals met: 0 of 13
22. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate5)
   added: (lifting hoist2 crate6) (clear crate5)
   changed: (fuel-cost) from 68 to 69
   goals met: 0 of 13
23. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 280 to 363
   goals met: 0 of 13
24. (lift hoist2 crate5 pallet2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 pallet2)
   added: (lifting hoist2 crate5) (clear pallet2)
   changed: (fuel-cost) from 69 to 70
   goals met: 0 of 13
25. (lift hoist1 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   changed: (fuel-cost) from 70 to 71
   goals met: 0 of 13
26. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 363 to 379
   goals met: 0 of 13
27. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 71 to 81
   goals met: 0 of 13
28. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 87 to 125
   goals met: 0 of 13
29. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 379 to 296
   goals met: 0 of 13
30. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 125 to 208
   goals met: 0 of 13
31. (lift hoist1 crate2 crate0 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate0)
   added: (lifting hoist1 crate2) (clear crate0)
   changed: (fuel-cost) from 81 to 82
   goals met: 0 of 13
32. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 296 to 332
   goals met: 0 of 13
33. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 82 to 83
   goals met: 0 of 13
34. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 208 to 275
   goals met: 0 of 13
35. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 83 to 93
   goals met: 0 of 13
36. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 93 to 103
   goals met: 0 of 13
37. (load hoist0 crate10 truck0 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck0) (available hoist0)
   changed: (current_load truck0) from 275 to 344
   goals met: 0 of 13
38. (lift hoist0 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate3)
   added: (lifting hoist0 crate7) (clear crate3)
   changed: (fuel-cost) from 103 to 104
   goals met: 0 of 13
39. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 104 to 114
   goals met: 0 of 13
40. (unload hoist2 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck1) from 332 to 299
   goals met: 0 of 13
41. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 114 to 124
   goals met: 0 of 13
42. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 299 to 350
   goals met: 0 of 13
43. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   changed: (current_load truck0) from 344 to 258
   goals met: 0 of 13
44. (drop hoist0 crate11 crate3 depot0)
   deleted: (lifting hoist0 crate11) (clear crate3)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate3)
   goals met: 0 of 13
45. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 350 to 334
   goals met: 0 of 13
46. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 258 to 274
   goals met: 0 of 13
47. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 274 to 236
   goals met: 0 of 13
48. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 334 to 372
   goals met: 0 of 13
49. (lift hoist0 crate11 crate3 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate3)
   added: (lifting hoist0 crate11) (clear crate3)
   changed: (fuel-cost) from 124 to 125
   goals met: 0 of 13
50. (drop hoist2 crate12 pallet2 distributor1)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 distributor1) (clear crate12) (on crate12 pallet2)
   goals met: 1 of 13
51. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   changed: (current_load truck0) from 236 to 322
   goals met: 1 of 13
52. (unload hoist0 crate14 truck0 depot0)
   deleted: (in crate14 truck0) (available hoist0)
   added: (lifting hoist0 crate14)
   changed: (current_load truck0) from 322 to 321
   goals met: 1 of 13
53. (load hoist0 crate14 truck1 depot0)
   deleted: (lifting hoist0 crate14)
   added: (in crate14 truck1) (available hoist0)
   changed: (current_load truck1) from 372 to 373
   goals met: 1 of 13
54. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck1) from 373 to 322
   goals met: 1 of 13
55. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 125 to 135
   goals met: 1 of 13
56. (unload hoist2 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck0) from 321 to 235
   goals met: 1 of 13
57. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 135 to 145
   goals met: 1 of 13
58. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 235 to 286
   goals met: 1 of 13
59. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 322 to 286
   goals met: 1 of 13
60. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 286 to 322
   goals met: 1 of 13
61. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 322 to 271
   goals met: 1 of 13
62. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 286 to 337
   goals met: 1 of 13
63. (unload hoist0 crate4 truck1 depot0)
   deleted: (in crate4 truck1) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck1) from 337 to 299
   goals met: 1 of 13
64. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 271 to 309
   goals met: 1 of 13
65. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 309 to 226
   goals met: 1 of 13
66. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 299 to 382
   goals met: 1 of 13
67. (lift hoist0 crate3 crate1 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate1)
   added: (lifting hoist0 crate3) (clear crate1)
   changed: (fuel-cost) from 145 to 146
   goals met: 1 of 13
68. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 226 to 313
   goals met: 1 of 13
69. (unload hoist0 crate14 truck1 depot0)
   deleted: (in crate14 truck1) (available hoist0)
   added: (lifting hoist0 crate14)
   changed: (current_load truck1) from 382 to 381
   goals met: 1 of 13
70. (load hoist0 crate14 truck0 depot0)
   deleted: (lifting hoist0 crate14)
   added: (in crate14 truck0) (available hoist0)
   changed: (current_load truck0) from 313 to 314
   goals met: 1 of 13
71. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   changed: (current_load truck0) from 314 to 245
   goals met: 1 of 13
72. (drop hoist0 crate10 crate1 depot0)
   deleted: (lifting hoist0 crate10) (clear crate1)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 crate1)
   goals met: 1 of 13
73. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck1) from 381 to 330
   goals met: 1 of 13
74. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 245 to 296
   goals met: 1 of 13
75. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 296 to 280
   goals met: 1 of 13
76. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   changed: (current_load truck1) from 330 to 346
   goals met: 1 of 13
77. (lift hoist0 crate10 crate1 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate1)
   added: (lifting hoist0 crate10) (clear crate1)
   changed: (fuel-cost) from 146 to 147
   goals met: 1 of 13
78. (load hoist0 crate10 truck0 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck0) (available hoist0)
   changed: (current_load truck0) from 280 to 349
   goals met: 1 of 13
79. (unload hoist0 crate14 truck0 depot0)
   deleted: (in crate14 truck0) (available hoist0)
   added: (lifting hoist0 crate14)
   changed: (current_load truck0) from 349 to 348
   goals met: 1 of 13
80. (load hoist0 crate14 truck1 depot0)
   deleted: (lifting hoist0 crate14)
   added: (in crate14 truck1) (available hoist0)
   changed: (current_load truck1) from 346 to 347
   goals met: 1 of 13
81. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 347 to 264
   goals met: 1 of 13
82. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 147 to 157
   goals met: 1 of 13
83. (load hoist2 crate11 truck1 distributor1)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck1) (available hoist2)
   changed: (current_load truck1) from 264 to 350
   goals met: 1 of 13
84. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 350 to 256
   goals met: 1 of 13
85. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 157 to 167
   goals met: 1 of 13
86. (unload hoist1 crate14 truck1 distributor0)
   deleted: (in crate14 truck1) (available hoist1)
   added: (lifting hoist1 crate14)
   changed: (current_load truck1) from 256 to 255
   goals met: 1 of 13
87. (drop hoist1 crate14 pallet1 distributor0)
   deleted: (lifting hoist1 crate14) (clear pallet1)
   added: (available hoist1) (at crate14 distributor0) (clear crate14) (on crate14 pallet1)
   goals met: 2 of 13
88. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 255 to 239
   goals met: 2 of 13
89. (drop hoist1 crate5 crate14 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate14)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate14)
   goals met: 3 of 13
90. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck1) from 239 to 147
   goals met: 3 of 13
91. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 167 to 177
   goals met: 3 of 13
92. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 147 to 241
   goals met: 3 of 13
93. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 177 to 187
   goals met: 3 of 13
94. (lift hoist2 crate12 pallet2 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist2) (on crate12 pallet2)
   added: (lifting hoist2 crate12) (clear pallet2)
   changed: (fuel-cost) from 187 to 188
   goals met: 2 of 13
95. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 241 to 324
   goals met: 2 of 13
96. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 348 to 312
   goals met: 2 of 13
97. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 324 to 360
   goals met: 2 of 13
98. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 360 to 277
   goals met: 2 of 13
99. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 188 to 198
   goals met: 2 of 13
100. (drop hoist2 crate12 pallet2 distributor1)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 distributor1) (clear crate12) (on crate12 pallet2)
   goals met: 3 of 13
101. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 277 to 183
   goals met: 3 of 13
102. (drop hoist1 crate8 crate5 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate5)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate5)
   goals met: 4 of 13
103. (drop hoist2 crate9 crate12 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate12)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate12)
   goals met: 5 of 13
104. (unload hoist2 crate13 truck1 distributor1)
   deleted: (in crate13 truck1) (available hoist2)
   added: (lifting hoist2 crate13)
   changed: (current_load truck1) from 183 to 122
   goals met: 5 of 13
105. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 198 to 208
   goals met: 5 of 13
106. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 122 to 205
   goals met: 5 of 13
107. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 208 to 209
   goals met: 5 of 13
108. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 205 to 299
   goals met: 5 of 13
109. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   changed: (current_load truck0) from 312 to 243
   goals met: 5 of 13
110. (load hoist0 crate10 truck1 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck1) (available hoist0)
   changed: (current_load truck1) from 299 to 368
   goals met: 5 of 13
111. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 209 to 219
   goals met: 5 of 13
112. (drop hoist2 crate13 crate9 distributor1)
   deleted: (lifting hoist2 crate13) (clear crate9)
   added: (available hoist2) (at crate13 distributor1) (clear crate13) (on crate13 crate9)
   goals met: 6 of 13
113. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 368 to 274
   goals met: 6 of 13
114. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 243 to 192
   goals met: 6 of 13
115. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 7 of 13
116. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 192 to 154
   goals met: 7 of 13
117. (drop hoist2 crate1 crate13 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate13)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate13)
   goals met: 8 of 13
118. (drop hoist0 crate4 crate7 depot0)
   deleted: (lifting hoist0 crate4) (clear crate7)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate7)
   goals met: 9 of 13
119. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 154 to 67
   goals met: 9 of 13
120. (drop hoist0 crate3 crate4 depot0)
   deleted: (lifting hoist0 crate3) (clear crate4)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate4)
   goals met: 10 of 13
121. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 67 to 0
   goals met: 10 of 13
122. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 274 to 191
   goals met: 10 of 13
123. (drop hoist2 crate6 crate1 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate1)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate1)
   goals met: 11 of 13
124. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck1) from 191 to 122
   goals met: 11 of 13
125. (drop hoist0 crate0 crate3 depot0)
   deleted: (lifting hoist0 crate0) (clear crate3)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate3)
   goals met: 12 of 13
126. (drop hoist2 crate10 crate6 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate6)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate6)
   goals met: 13 of 13
